// ملف database.js
const deliveryPrices = {
    "عنابة": 600, // يمكنك تحديث باقي الولايات من 1 إلى 26 لاحقاً
    "الجزائر": 500,
    "مستغانم": 600,
    "المسيلة": 650,
    "معسكر": 650,
    "ورقلة": 800,
    "وهران": 550,
    "البيض": 850,
    "إليزي": 1300,
    "برج بوعريريج": 600,
    "بومرداس": 500,
    "الطارف": 700,
    "تندوف": 1300,
    "تيسمسيلت": 700,
    "الوادي": 800,
    "خنشلة": 700,
    "سوق أهراس": 800,
    "تيبازة": 500,
    "ميلة": 650,
    "عين الدفلى": 600,
    "النعامة": 900,
    "عين تموشنت": 600,
    "غرداية": 850,
    "غليزان": 600,
    "تيميمون": 1200,
    "اولاد جلال": 800,
    "بني عباس": 1100,
    "عين صالح": 1200,
    "تقرت": 850,
    "المغير": 900,
    "المنيعة": 900
};

// دالة لتعبئة قائمة الولايات في الاستمارة
function initWilayas(wilayaSelectElement) {
    wilayaSelectElement.innerHTML = '<option value="">-- اختر الولاية --</option>';
    for (const wilaya in deliveryPrices) {
        wilayaSelectElement.innerHTML += `<option value="${wilaya}">${wilaya}</option>`;
    }
}
