const wilayasData = {
    "عنابة": {
        delivery: 600,
        communes: ["عنابة", "البوني", "الحجار", "برحال", "عين الباردة", "سرايدي"]
    },
    "الجزائر": {
        delivery: 500,
        communes: ["الجزائر الوسطى", "سيدي امحمد", "الرويبة", "باب الزوار", "الشراقة", "الزرالدة"]
    },
    "وهران": {
        delivery: 550,
        communes: ["وهران", "بئر الجير", "السانية", "أرزيو", "قديل"]
    },
    "مستغانم": {
        delivery: 600,
        communes: ["مستغانم", "حاسي مماش", "عين النويصي", "ماسرة"]
    }
    // أكمل باقي الولايات هنا حسب تسعيرة سوقلي
};
