const wilayasData = {

    // =========================================================
    // 01 - أدرار
    // =========================================================
    "أدرار": {
        code: "01",

        homeDelivery: 1000,
        deskDelivery: 600,
        delivery: 1000,

        deliveryDays: "3-7 أيام",

        deskAddress:
            "route de lycée EL MEGHILI derrière l'ancien conseil judiciaire - ADRAR",

        communes: [
            "أدرار",
            "أولاد أحمد تيمي",
            "فنوغيل",
            "زاوية كنتة",
            "رقان",
            "تسابيت",
            "تيمقتن",
            "تامنطيط",
            "سالي",
            "أولف",
            "بودة",
            "السبع",
            "تيدكلت",
            "شروين",
            "تيمياوين"
        ]
    },


    // =========================================================
    // 02 - الشلف
    // =========================================================
    "الشلف": {
        code: "02",

        homeDelivery: 600,
        deskDelivery: 350,
        delivery: 600,

        deliveryDays: "1-2 أيام",

        deskAddress:
            "HAY BENSSOUNA 48 LOGEMENTS CNP BLOCK D a cote de CASNOS",

        communes: [
            "الشلف",
            "تنس",
            "بوقادير",
            "بني حواء",
            "أبو الحسن",
            "أولاد فارس",
            "وادي الفضة",
            "الزبوجة",
            "تاوقريت",
            "المرسى",
            "أم الدروع",
            "سنجاس",
            "الكريمية",
            "وادي سلي",
            "الصبحة",
            "الهرانفة",
            "الظهرة",
            "عين مران",
            "بوزغاية",
            "سيدي عكاشة",
            "حرشون",
            "الحجاج",
            "مصدق",
            "بريرة",
            "الشطية",
            "سيدي عبد الرحمن",
            "تلعصة",
            "أولاد بن عبد القادر",
            "بنايرية",
            "البيضاء",
            "الولجة",
            "بوزيان",
            "السنجل",
            "الماين",
            "الكناندة"
        ]
    },


    // =========================================================
    // 03 - الأغواط
    // =========================================================
    "الأغواط": {
        code: "03",

        homeDelivery: 750,
        deskDelivery: 500,
        delivery: 750,

        deliveryDays: "1-3 أيام",

        deskAddress:
            "rue ben sahnoun a cote de centre d'imagerie laghouati, cité el makam, laghouat",

        communes: [
            "الأغواط",
            "آفلو",
            "قصر الحيران",
            "حاسي الرمل",
            "عين ماضي",
            "الحويطة",
            "تاويالة",
            "الغيشة",
            "وادي مرة",
            "سبقاق",
            "سيدي مخلوف",
            "تاجرونة",
            "البيضاء",
            "الحاج المشري",
            "بن ناصر بن شهرة",
            "العسافية",
            "الأغواط القديمة",
            "وادي مزي",
            "قلتة سيدي سعد",
            "عين سيدي علي",
            "برج السنوسي",
            "أم العصاف"
        ]
    },


    // =========================================================
    // 04 - أم البواقي
    // =========================================================
    "أم البواقي": {
        code: "04",

        homeDelivery: 700,
        deskDelivery: 400,
        delivery: 700,

        deliveryDays: "1-3 أيام",

        deskAddress:
            "Ain fekroun, a 300 m station des bus a cote de l'agence CNAS",

        communes: [
            "أم البواقي",
            "عين البيضاء",
            "عين مليلة",
            "سيقوس",
            "عين فكرون",
            "عين كرشة",
            "الضلعة",
            "العامرية",
            "بحير شرقي",
            "الزرق",
            "الفجوج بوغرارة",
            "الحرملية",
            "أولاد حملة",
            "الرحية",
            "مسكيانة",
            "بئر الشهداء",
            "الجازية",
            "سوق نعمان",
            "وادي نيني",
            "البلالة",
            "قصر الصبيحي",
            "عين الزيتون",
            "العامرية",
            "أولاد زواي",
            "الجعافرة",
            "هنشير تومغني",
            "الراحية",
            "بريش"
        ]
    },


    // =========================================================
    // 05 - باتنة
    // =========================================================
    "باتنة": {
        code: "05",

        homeDelivery: 650,
        deskDelivery: 350,
        delivery: 650,

        deliveryDays: "1-3 أيام",

        deskAddress:
            "rond point de cite 1020 Igtms la route vers CASNOS",

        communes: [
            "باتنة",
            "بريكة",
            "أريس",
            "مروانة",
            "عين التوتة",
            "نقاوس",
            "رأس العيون",
            "تازولت",
            "المعذر",
            "سريانة",
            "نقاوس",
            "تيمقاد",
            "الشّمرة",
            "بومية",
            "وادي الماء",
            "منعة",
            "إشمول",
            "إينوغيسن",
            "ثنية العابد",
            "تكوت",
            "كيمل",
            "فم الطوب",
            "القنطرة",
            "عيون العصافير",
            "جرمة",
            "الحاسي",
            "حيدوسة",
            "أولاد سلام",
            "تالخمت",
            "أولاد سي سليمان",
            "شير",
            "الشمرة",
            "بولهيلات",
            "لازرو",
            "سقانة",
            "عين جاسر",
            "عين ياقوت",
            "وادي الشعبة",
            "حملة",
            "بوزينة",
            "بني فضالة الحقانية",
            "لمسان",
            "الرحبات",
            "تيغرغار",
            "أولاد عوف",
            "القصبات",
            "زانة البيضاء",
            "وادي الطاقة",
            "تغرغار"
        ]
    },


    // =========================================================
    // 06 - بجاية
    // =========================================================
    "بجاية": {
        code: "06",

        homeDelivery: 550,
        deskDelivery: 300,
        delivery: 550,

        deliveryDays: "1-3 أيام",

        deskAddress:
            "promotionn immobilière EPBTP bloc 4 en face centre commercial boubaya",

        communes: [
            "بجاية",
            "أقبو",
            "أميزور",
            "توقجة",
            "خراطة",
            "القصر",
            "سوق الإثنين",
            "تيشي",
            "صدوق",
            "سيدي عيش",
            "شميني",
            "أوزلاقن",
            "فناية الماثن",
            "بوخليفة",
            "برباشة",
            "بني معوش",
            "بني كسيلة",
            "بوجليل",
            "بوحمزة",
            "تازمالت",
            "تامقرة",
            "تيفرة",
            "تيزي نبربر",
            "تيزيلي",
            "ذراع القايد",
            "شميني",
            "سيدي عيش",
            "سيدي عياد",
            "سوق أوفلا",
            "تالة حمزة",
            "توجة",
            "أوقاس",
            "وادي غير",
            "إغرام",
            "إغيل علي",
            "إغيل قزاز",
            "مالبو",
            "مسيسنة",
            "أدكار",
            "أكفادو",
            "لفلاي",
            "فلاي",
            "بني جليل"
        ]
    },


    // =========================================================
    // 07 - بسكرة
    // =========================================================
    "بسكرة": {
        code: "07",

        homeDelivery: 800,
        deskDelivery: 500,
        delivery: 800,

        deliveryDays: "2-4 أيام",

        deskAddress:
            "Cité 350 logements Participatifs Zone ouest Bloc 09 local 191",

        communes: [
            "بسكرة",
            "طولقة",
            "سيدي عقبة",
            "زريبة الوادي",
            "أورلال",
            "الحوش",
            "جمورة",
            "القنطرة",
            "ليوة",
            "مشونش",
            "مزيرعة",
            "الفيض",
            "فوغالة",
            "الغروس",
            "لوطاية",
            "مليلي",
            "أوماش",
            "عين الناقة",
            "الحاجب",
            "خنقة سيدي ناجي",
            "برانيس",
            "الوطاية",
            "عين زعطوط",
            "القنطرة",
            "سيدي خالد",
            "الدوسن",
            "رأس الميعاد",
            "بوشقرون",
            "أمليلي",
            "الشعيبة",
            "الزعاطشة",
            "الحاجب",
            "ليشانة",
            "الغروس",
            "أورلال"
        ]
    },


    // =========================================================
    // 08 - بشار
    // =========================================================
    "بشار": {
        code: "08",

        homeDelivery: 1050,
        deskDelivery: 700,
        delivery: 1050,

        deliveryDays: "3-5 أيام",

        deskAddress:
            "centre ville just a coté de laboratoire d'analyses ABSI - BECHAR",

        communes: [
            "بشار",
            "بني عباس",
            "العبادلة",
            "تاغيت",
            "القنادسة",
            "كرزاز",
            "الواتة",
            "بني ونيف",
            "إقلي",
            "لحمر",
            "مريجة",
            "موغل",
            "بوكايس",
            "تبلبالة",
            "تيمودي",
            "قصابي",
            "أولاد خضير",
            "تامترت",
            "زغامرة",
            "القصابي",
            "كرزاز",
            "إقلي"
        ]
    },


    // =========================================================
    // 09 - البليدة
    // =========================================================
    "البليدة": {
        code: "09",

        homeDelivery: 250,
        deskDelivery: 0,
        delivery: 250,

        deliveryDays: "24 ساعة",

        deskAddress:
            "monponsie en face lycée omar ibn khatab",

        communes: [
            "البليدة",
            "بوفاريك",
            "أولاد يعيش",
            "العفرون",
            "موزاية",
            "بني مراد",
            "بوعينان",
            "بوقرة",
            "الشفة",
            "الشريعة",
            "وادي جر",
            "حمام ملوان",
            "جبابرة",
            "صوحان",
            "الأربعاء",
            "مفتاح",
            "بني تامو",
            "بن خليل",
            "القرواو",
            "الأوريسية",
            "عين الرمانة",
            "واد العلايق",
            "بوعرفة",
            "شريعة"
        ]
    },


    // =========================================================
    // 10 - البويرة
    // =========================================================
    "البويرة": {
        code: "10",

        homeDelivery: 600,
        deskDelivery: 400,
        delivery: 600,

        deliveryDays: "1-2 أيام",

        deskAddress:
            "Cadat B ville de bouira",

        communes: [
            "البويرة",
            "سور الغزلان",
            "الأخضرية",
            "مشدالله",
            "برج أوخريص",
            "عين بسام",
            "بئر غبالو",
            "حيزر",
            "ديرة",
            "الهاشمية",
            "القادرية",
            "العجيبة",
            "أهل القصر",
            "أيت لعزيز",
            "أغبالو",
            "الحاكمية",
            "بشلول",
            "بغلية",
            "بودربالة",
            "بوكرام",
            "بويرة",
            "جباحية",
            "دلس",
            "الجباحية",
            "قرومة",
            "الخبوزية",
            "معلة",
            "المقراني",
            "وادي البردي",
            "روراوة",
            "سحاريج",
            "سوق الخميس",
            "تاغزوت",
            "عين الحجر",
            "عين الترك",
            "الشرفة",
            "أحنيف",
            "أيت لعزيز",
            "تاقديت",
            "أولاد راشد",
            "الزبربر",
            "المريرة",
            "الحجرة الزرقاء"
       ]

    },

    
    // =========================================================
    // 11 - تمنراست
    // =========================================================
    "تمنراست": {
        code: "11",
        homeDelivery: 1200,
        deskDelivery: 600,
        delivery: 1200,
        deliveryDays: "1-3 أيام",
        deskAddress: "cité el horfra sarsoufa à coté du SEAL",

        communes: [
            "تمنراست",
            "عين أمقل",
            "إدلس",
            "تاظروك",
            "أبلسة",
            "فقارة الزوى"
        ]
    },


    // =========================================================
    // 12 - تبسة
    // =========================================================
    "تبسة": {
        code: "12",
        homeDelivery: 700,
        deskDelivery: 450,
        delivery: 700,
        deliveryDays: "1-3 أيام",
        deskAddress: "Skanska, citè el Amel derrière la grande mosquèe",

        communes: [
            "تبسة",
            "الشريعة",
            "العوينات",
            "بئر العاتر",
            "الونزة",
            "العقلة",
            "الماء الأبيض",
            "مرسط",
            "نقرين",
            "بكارية",
            "الحويجبات",
            "المريج",
            "بوخضرة",
            "ثليجان",
            "صفصاف الوسرة",
            "بئر مقدم",
            "المزرعة",
            "الحمامات",
            "بولحاف الدير",
            "الكويف",
            "عين الزرقاء",
            "فركان",
            "قوراي",
            "سطح قنطيس",
            "السطح",
            "بجن",
            "بئر الذهب",
            "العقلة المالحة",
            "أم علي",
            "عين شنيق"
        ]
    },


    // =========================================================
    // 13 - تلمسان
    // =========================================================
    "تلمسان": {
        code: "13",
        homeDelivery: 700,
        deskDelivery: 400,
        delivery: 700,
        deliveryDays: "1-3 أيام",
        deskAddress: "Rue de Chetouane A coté de la station d'essence sidi said",

        communes: [
            "تلمسان",
            "مغنية",
            "الغزوات",
            "سبدو",
            "الرمشي",
            "شتوان",
            "منصورة",
            "المنصورة",
            "هنين",
            "ندرومة",
            "سيدي الجيلالي",
            "سيدي العبدلي",
            "سيدي بوسيدي",
            "عين تالوت",
            "عين فزة",
            "عين فتاح",
            "عين غرابة",
            "أولاد ميمون",
            "بني مستار",
            "بني صميل",
            "بني خلاد",
            "بني سنوس",
            "بني وارسوس",
            "بوحلو",
            "بوصمغون",
            "البويهي",
            "الحناية",
            "دار يغمراسن",
            "الفحول",
            "فلاوسن",
            "جبالة",
            "المرسى بن مهيدي",
            "مسيردة الفواقة",
            "أميرة",
            "صبرة",
            "سبرا",
            "سوق الثلاثاء",
            "سيدي مجاهد",
            "سيدي العجال",
            "سيدي الجيلالي",
            "سوق الأربعاء",
            "تيانت",
            "تيانيت",
            "ترني بني هديل",
            "زناتة"
        ]
    },


    // =========================================================
    // 14 - تيارت
    // =========================================================
    "تيارت": {
        code: "14",
        homeDelivery: 700,
        deskDelivery: 400,
        delivery: 700,
        deliveryDays: "1-3 أيام",
        deskAddress: "en face mosquée EL SALEM, EPLF tiaret ville",

        communes: [
            "تيارت",
            "السوقر",
            "فرندة",
            "قصر الشلالة",
            "مهدية",
            "عين الذهب",
            "عين الحديد",
            "عين بوشقيف",
            "بوقرة",
            "دحموني",
            "دائرة مدروسة",
            "الحمادية",
            "حمادية",
            "جيلالي بن عمار",
            "مغيلة",
            "ملاكو",
            "مهدية",
            "مدروسة",
            "مشرع الصفا",
            "ناظورة",
            "النعيمة",
            "رحوية",
            "سبعين",
            "سيدي علي ملال",
            "سيدي بختي",
            "سيدي حسني",
            "سرغين",
            "تاقدمت",
            "تخمارت",
            "توسنينة",
            "زمالة الأمير عبد القادر",
            "واد ليلي"
        ]
    },


    // =========================================================
    // 15 - تيزي وزو
    // =========================================================
    "تيزي وزو": {
        code: "15",
        homeDelivery: 550,
        deskDelivery: 350,
        delivery: 550,
        deliveryDays: "1-2 أيام",
        deskAddress: "En face les batiments blues",

        communes: [
            "تيزي وزو",
            "عزازقة",
            "ذراع الميزان",
            "بوغني",
            "ذراع بن خدة",
            "الأربعاء ناث إيراثن",
            "أغريب",
            "أيت بومهدي",
            "أيت خليلي",
            "أيت يحيى",
            "أيت محمود",
            "أيت أومالو",
            "أيت تودرت",
            "أيت بوعدو",
            "أيت شافع",
            "أيت خليل",
            "أيت يحيى موسى",
            "بونوح",
            "بني دوالة",
            "بني زكي",
            "بني عيسي",
            "بوجيمة",
            "بوزغن",
            "بوعدنان",
            "بني زمنزار",
            "بني يني",
            "تادمايت",
            "تيقزيرت",
            "تيرمتين",
            "تيزي غنيف",
            "تيزي نتلاثة",
            "تيزي راشد",
            "تيزي وزو",
            "واسيف",
            "واقنون",
            "إيفيغاء",
            "إبودرارن",
            "إمسوحال",
            "إفليسن",
            "إيلولة أومالو",
            "إعكوران",
            "فريحة",
            "فريقات",
            "قرقور",
            "مكيرة",
            "مقلع",
            "معاتقة",
            "مزارنة",
            "مزرانة",
            "سيدي نعمان",
            "سوق الإثنين",
            "سوق الأحد",
            "تيزي نثلاثة",
            "ترمتين",
            "واسيف"
        ]
    },


    // =========================================================
    // 16 - الجزائر
    // =========================================================
    "الجزائر": {
        code: "16",
        homeDelivery: 250,
        deskDelivery: 100,
        delivery: 250,
        deliveryDays: "24 ساعة",

        deskAddress:
            "Birkhadem, CHEMAIN ROMAIN 07-70-23-81-51 | CHERAGA: a cote de l'institut pastor 07-70-80-31-37 | REGHAIA: cité LPP bourada - reghaia 05-55-21-42-18",

        communes: [
            "الجزائر الوسطى",
            "باب الزوار",
            "الرويبة",
            "سيدي امحمد",
            "الشراقة",
            "زرالدة",
            "بئر خادم",
            "بئر مراد رايس",
            "بن عكنون",
            "الأبيار",
            "حيدرة",
            "المدنية",
            "المرادية",
            "القبة",
            "حسين داي",
            "المحمدية",
            "برج الكيفان",
            "برج البحري",
            "دار البيضاء",
            "باب الوادي",
            "القصبة",
            "وادي قريش",
            "بولوغين",
            "الرايس حميدو",
            "دالي إبراهيم",
            "الحمامات",
            "عين البنيان",
            "اسطاوالي",
            "سطاوالي",
            "سيدي فرج",
            "الدويرة",
            "خرايسية",
            "بابا حسن",
            "العاشور",
            "الدرارية",
            "بئر توتة",
            "أولاد شبل",
            "تسالة المرجة",
            "سيدي موسى",
            "براقي",
            "الكاليتوس",
            "المقرية",
            "باش جراح",
            "بوروبة",
            "الحراش",
            "وادي السمار",
            "الدار البيضاء",
            "برج الكيفان",
            "الرغاية",
            "هراوة",
            "عين طاية",
            "برج البحري",
            "المرسى",
            "المعالمة",
            "الرحمانية",
            "سويدانية",
            "سطاوالي",
            "زرالدة"
        ]
    },


    // =========================================================
    // 17 - الجلفة
    // =========================================================
    "الجلفة": {
        code: "17",
        homeDelivery: 750,
        deskDelivery: 500,
        delivery: 750,
        deliveryDays: "1-2 أيام",
        deskAddress:
            "cité 05 juillet vers l'université ZIAN ACHOUR en face commisariat centrale",

        communes: [
            "الجلفة",
            "عين وسارة",
            "مسعد",
            "حاسي بحبح",
            "الإدريسية",
            "دار الشيوخ",
            "الشارف",
            "البيرين",
            "حد الصحاري",
            "سيدي لعجال",
            "عين الإبل",
            "عين معبد",
            "بن يعقوب",
            "بويرة الأحداب",
            "عمورة",
            "دلدول",
            "دويس",
            "فيض البطمة",
            "قرنيني",
            "حاسي العش",
            "حاسي فدول",
            "الخميس",
            "مليليحة",
            "مقرن",
            "مجبارة",
            "قطارة",
            "سد رحال",
            "سلمانة",
            "سيدي بايزيد",
            "سيدي عامر",
            "تعظميت",
            "زعفران",
            "القديد"
        ]
    },


    // =========================================================
    // 18 - جيجل
    // =========================================================
    "جيجل": {
        code: "18",
        homeDelivery: 600,
        deskDelivery: 400,
        delivery: 600,
        deliveryDays: "1-3 أيام",
        deskAddress:
            "rue bouicher messaoud cité agouf camp chevalier",

        communes: [
            "جيجل",
            "الميلية",
            "الطاهير",
            "العوانة",
            "تاكسنة",
            "الجمعة بني حبيبي",
            "الشحنة",
            "القنار نشفي",
            "العنصر",
            "بوراوي بلهادف",
            "برج الطهر",
            "بودريعة بن ياجيس",
            "بوسيف أولاد عسكر",
            "بني ياجيس",
            "جيملة",
            "خيري واد عجول",
            "سلمى بن زيادة",
            "سيدي عبد العزيز",
            "سيدي معروف",
            "سطارة",
            "وجانة",
            "زيامة منصورية",
            "أولاد رابح",
            "أولاد يحيى خدروش",
            "غبالة",
            "قاوس",
            "الجمعة بني حبيبي",
            "دلس",
            "إيراقن سويسي",
            "العنصر"
        ]
    },


    // =========================================================
    // 19 - سطيف
    // =========================================================
    "سطيف": {
        code: "19",
        homeDelivery: 550,
        deskDelivery: 350,
        delivery: 550,
        deliveryDays: "1-3 أيام",

        deskAddress:
            ",SETIF : Cite el hidab 50 lgtms, LST /////////////// EULMA: à coté d un cafè STARBUCKS",

        communes: [
            "سطيف",
            "العلمة",
            "عين ولمان",
            "بوقاعة",
            "عين أرنات",
            "عين أزال",
            "عين عباسة",
            "عين الحجر",
            "عين الكبيرة",
            "عين لقراج",
            "بئر العرش",
            "بني عزيز",
            "بني فودة",
            "بني ورتيلان",
            "بني شبانة",
            "بني محلي",
            "بوسلام",
            "بوقاعة",
            "بوطالب",
            "بئر حدادة",
            "دهامشة",
            "جميلة",
            "حمام قرقور",
            "حربيل",
            "قجال",
            "قنزات",
            "قلال",
            "معاوية",
            "مزلوق",
            "موكلان",
            "واد البارد",
            "أولاد عدوان",
            "أولاد صابر",
            "الرصفة",
            "صالح باي",
            "سرج الغول",
            "تيزي نبشار",
            "تلة",
            "تاشودة",
            "الطاية",
            "تيزي نبشار",
            "عين السبت",
            "عين الروى",
            "الدهامشة",
            "الأوريسية"
        ]
    },


    // =========================================================
    // 20 - سعيدة
    // =========================================================
    "سعيدة": {
        code: "20",
        homeDelivery: 750,
        deskDelivery: 450,
        delivery: 750,
        deliveryDays: "1-3 أيام",

        deskAddress:
            "Rue Belarbi Laaredj sur la ligne de 20 l'hotel EL MORDJANE - SAIDA centre ville",

        communes: [
            "سعيدة",
            "عين الحجر",
            "سيدي بوبكر",
            "الحساسنة",
            "يوب",
            "عين السلطان",
            "أولاد خالد",
            "عين السخونة",
            "دوي ثابت",
            "مولاي العربي",
            "المعمورة",
            "أولاد إبراهيم",
            "سيدي أحمد",
            "تيرسين",
            "هونت",
            "عين السلطان",
            "عين الزرقاء",
            "الرباحية"
        ]
    },
    };
